package com.yjk.app.test;

import org.apache.commons.lang.StringUtils;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.boot.test.context.SpringBootTest;
import org.springframework.test.context.junit4.SpringRunner;

import com.ctc.wstx.util.StringUtil;
import com.yjk.app.dao.ModelMapper;
import com.yjk.app.dao.SpecMapper;
import com.yjk.app.dao.TwoStagemodelMapper;
import com.yjk.app.entity.ModelDO;
import com.yjk.app.entity.SpecDO;
import com.yjk.app.entity.TwoStagemodelDO;

@RunWith(SpringRunner.class)  
@SpringBootTest 
public class MTSTest {

	@Autowired
	ModelMapper modelMapper;
	@Autowired
	TwoStagemodelMapper twoStagemodelMapper;
	@Autowired
	SpecMapper specMapper;
	
	@Test
	public void test() {/*
		String str = "挖掘机\r\n" + 
				"履带挖掘机：1吨、3吨、6吨、10吨、15吨、20吨、25吨、30吨、35吨、40吨、45吨、50吨、60吨、70吨、80吨、100吨、150吨、200吨、300吨、500吨及以上\r\n" + 
				"轮挖：6吨、6吨带破碎、6吨带夹木、10吨、10吨带破碎、15吨、15吨带破碎、20吨、20吨带破碎、25吨及以上\r\n" + 
				"加长臂挖掘机：16米、16米带破碎、18米、18米带破碎、22米、22米带破碎、25米、28米、30米及以上\r\n" + 
				"高空拆除机带液压剪：18米、20米、25米、30米、35米、45米及以上\r\n" + 
				"伸缩臂挖掘机：16米、20米、26米、32米及以上\r\n" + 
				"船挖：60加长臂、150、150加长臂、200、200加长臂、240、240加长臂、300加长臂\r\n" + 
				"挖掘机带破碎锤：1吨、3吨、6吨、10吨、15吨、20吨、25吨、30吨、36吨、40吨、45吨、50吨及以上\r\n" + 
				"挖掘机带松土器：20吨、30吨、40吨、50吨、60吨、80吨、90吨及以上\r\n" + 
				"推土机\r\n" + 
				"干地推土机：100及以下、120、130、140、160手动挡、160自动挡、160带松土器、220、220带单齿松土器、220带三齿松土器、320、320带单齿松土器、420、520、700、900及以上、\r\n" + 
				"湿地推土机：100、130、160手动、160自动、160静液压、160超湿地、180、220、220静液压、80及以下、100、120、140、D2水鸭子超湿地、D3水鸭子超湿地\r\n" + 
				"造型推土机：D3干地、D3湿地、D4干地、D4湿地、D5干地、D5湿地、D6干地、D6湿地\r\n" + 
				"轮式推土机：180马力、220马力及以上\r\n" + 
				"装载机\r\n" + 
				"轮式装载机：1吨、2吨、2吨夹木、3吨、3吨侧卸、3吨夹木、5吨、5吨侧卸、5吨夹木、6吨、6吨侧卸、8吨、10吨、12吨及以上\r\n" + 
				"滑移装载机：2吨、2吨带清扫、2吨带铣刨、3吨、3吨带清扫、3吨带铣刨、4吨、4吨带清扫、4吨带铣刨\r\n" + 
				"履带装载机：3吨、5吨、6吨及以上\r\n" + 
				"挖掘装载机俩头忙：7吨、7吨带破碎、7吨带六合一斗、9吨、9吨带破碎、9吨带六合一斗\r\n" + 
				"牵引式铲运机：2.5方、3方、4方、6方\r\n" + 
				"自行式铲运机：6方、9方、12方、18方及以上\r\n" + 
				"平地机\r\n" + 
				"平地机：100、130、160、165、180、220、260、300、500及以上\r\n" + 
				"拖拉机牵引式平地机：2吨、3吨、4吨、5吨\r\n" + 
				"拖拉机披挂式平地机：80马力、120马力、150马力及以上\r\n" + 
				"压路机\r\n" + 
				"静压路机：3吨、5吨、8吨、12吨、15吨、18吨、21吨、24吨、26吨及以上\r\n" + 
				"单钢轮压路机：12吨、16吨、18吨、18吨带羊角碾、20吨、20吨带羊角碾、22吨、22吨带羊角碾、24吨、24吨带羊角碾、26吨、32吨及以上\r\n" + 
				"双钢轮压路机：1吨、3吨、6吨、8吨、12吨、15吨、18吨、22吨及以上、\r\n" + 
				"胶轮压路机：3吨前钢后胶、5吨前钢后胶、16吨、20吨、24吨、26吨、30吨、32吨、40吨及以上\r\n" + 
				"冲击夯压路机：20千焦三边型、20千焦五边梅花型、25千焦三边、25千焦五边梅花型、32千焦三边型、35千焦三边型\r\n" + 
				"门式破碎路机：160马力、220马力及以上\r\n" + 
				"锤点式破碎路机：230马力、360马力、400马力及以上\r\n" + 
				"起重机\r\n" + 
				"汽车吊：5吨五节臂、5吨九节臂、8吨、12吨、16吨四节臂、16吨五节臂、20吨、25吨四节臂、25吨五节臂、35吨五节臂、35吨六节臂、50吨五节臂、50吨六节臂、70吨、80吨、100吨、150吨、200吨、350吨、400吨、500吨、600吨、800吨、1200吨、1600吨及以上\r\n" + 
				"随车吊：5吨、8吨、12吨、16吨、25吨、35吨超低折臂、50吨超低折臂、90吨超低折臂、120吨超低折臂\r\n" + 
				"履带吊：25吨、25吨强夯机、50吨、50吨强夯机、100吨、150吨、250吨、450吨、600吨、900吨、1200吨、2000吨、3600吨及以上\r\n" + 
				"塔吊：40米4吨、40米8吨、50米4吨、50米6吨、65米6吨、65米8吨、75米10吨、75米12吨、75米16吨、75米40吨、75米100吨、70米125吨80米25吨、80米32吨、80米60吨、110米80吨、\r\n" + 
				"施工升降机：1吨、2吨、3吨、4吨\r\n" + 
				"越野吊车：25吨、30吨、50吨、80吨、100吨及以上\r\n" + 
				"架桥机：双梁型30米100吨、双梁型40米160吨、双梁型50米200吨、悬臂式30米70吨、悬臂式40米100吨、拼装型600吨、导梁式900吨、轮胎式运架一体机900吨、过隧道型900吨\r\n" + 
				"门式起重机：24米10吨、30米30吨、32米50吨、22米50吨、24米80吨、30米100吨、28米20吨、24米40吨、22米20吨、21米32吨、45米900吨轮胎式提梁机、40米200吨提梁机、40米450吨提梁机、41米900吨提梁机\r\n" + 
				"平板车\r\n" + 
				"本地平板车：4.2米、6.8米、9.6米、13米、16米、17.5米\r\n" + 
				"中短途回程平板车：6.8米、9.6米、11米、13米、16米、16米三线六轴、17.5米\r\n" + 
				"长途平板车：6.8米、9.6米、13米、16米、16米三线六轴、17.5米\r\n" + 
				"超重大件低平板车：60吨、80吨、100吨、200吨及以上\r\n" + 
				"运桥梁专用平板车：50吨挂车、80吨挂车、100吨、180吨、300吨、450吨、500吨、600吨、900吨\r\n" + 
				"叉车\r\n" + 
				"叉车：1吨、2吨、2吨带抱夹、3吨、3吨带抱夹、3吨越野型、5吨、5吨带抱夹、5吨越野型、8吨、10吨、12吨、16吨及以上、\r\n" + 
				"叉装车：20吨、25吨、30吨、40吨、50吨及以上\r\n" + 
				"伸缩臂叉车：2吨6米、3吨9米、5吨12米、6吨20米、8吨25米\r\n" + 
				"环卫洒水机械\r\n" + 
				"洒水车：4方、6方、10方、12方、16方、20方及以上、\r\n" + 
				"洒水高压清洗车：4方、6方、10方、16方、20方及以上、\r\n" + 
				"洒水雾炮车：6方10米、10方15米、12立方20米、14立方25米、18方20米、22方25米\r\n" + 
				"扫地车：2.2米、3米、3.5米、清洗护栏车\r\n" + 
				"垃圾压实机：20吨、25吨、28吨、32吨、40吨、45吨及以上\r\n" + 
				"环卫推土机：140马力、160马力、220马力及以上、\r\n" + 
				"混凝土设备\r\n" + 
				"臂架泵车：28米、37米、46米、56米、66米、76米、86米、92米、100米及以上、\r\n" + 
				"车载柴油混凝土泵：80方16兆帕、80方32兆帕、90方16兆帕、90方22兆帕、100方22兆帕、100方28兆帕、110方22兆帕、110方27兆帕、\r\n" + 
				"电动混凝土拖泵：45方10兆帕、60方16兆帕、75方40兆帕、80方18兆帕、90方18兆帕、100方20兆帕、110方22兆帕、120方20兆帕\r\n" + 
				"柴油混凝土拖泵：60方22兆帕、80方18兆帕、90方28兆帕、100方22兆帕、120方26兆帕、\r\n" + 
				"混凝土搅拌车：4方、8方、10方、12方、16方、18方\r\n" + 
				"混凝土拌合站：60方/小时、120方/小时、240方/小时、270方/小时及以上\r\n" + 
				"砂浆搅拌站：40吨/小时、60吨/小时、80吨/小时、120吨/小时\r\n" + 
				"稳定土拌合机\r\n" + 
				"冷再生机：200、230、260、420、460、500、550及以上\r\n" + 
				"自走式稳拌大宝马：2米、2.2米、2.5米、2.8米、3米\r\n" + 
				"拖拉机稳拌小宝马：80马力、100马力、120马力、150马力及以上\r\n" + 
				"拖拉机悬挂铧犁：双铧犁、三铧犁、四铧犁、重型四铧犁、五铧犁、牵引重型五铧犁\r\n" + 
				"水泥撒布车：8方、10方、12方、16方及以上\r\n" + 
				"稳定土拌合站：300型、400型、500型、600型、800型及以上\r\n" + 
				"铣刨机\r\n" + 
				"履带式铣刨机：1米、1.5米、2米、2.2米、2.5米及以上\r\n" + 
				"轮式铣刨机：0.25米、0.5米、1米、1.5米\r\n" + 
				"滑移机配铣刨机：0.25米、0.5米、1米\r\n" + 
				"自卸车\r\n" + 
				"环保自卸车：4方、6方、10方、12方、16方、18方、22方、24方及以上\r\n" + 
				"非环保自卸车：2方四不像、4方四不像、6方四不像、8方四不像、10方四不像、4方588、6方608、8方、12方、16方、20方、24方、28方、30方及以上\r\n" + 
				"铰接式自卸车：20吨、25吨、30吨、35吨、40吨、45吨、50吨及以上\r\n" + 
				"履带式运泥车：20型、30型、50型、60型及以上\r\n" + 
				"高空作业车（平台）\r\n" + 
				"车载高空作业车：6米、9米、12米、15米、18米、24米、32米及以上、\r\n" + 
				"剪叉式高空平台：6米、9米、12米、15米及以上、\r\n" + 
				"臂架式高空车：6米、9米、12米、16米、20米、24米、30米、40米、55米、60米\r\n" + 
				"伸缩式高空作业车：5米、8米、10米、12米、16米、26米、32米、34米、40米及以上\r\n" + 
				"高空搬运云梯车：25米0.5吨、28米1吨、32米0.5吨、45米0.5吨、32米消防、46米消防、60米消防、100米消防、\r\n" + 
				"室内高空蜘蛛吊（车）：17米、22米、26米、30米、35米、39米、42米、48米、52米及以上、\r\n" + 
				"钻机系列\r\n" + 
				"旋挖钻：100型轮式、100型、120型轮式、150型、180型、220型、280型、320型、360型、420型、460型、500型、600型及以上\r\n" + 
				"长螺旋钻机：20米、25米、30米、35米及以上、\r\n" + 
				"循环钻机：1米、1.5米、2米、2.5米、3米、3.2米、\r\n" + 
				"反循环钻机：1.3米、1.5米、2米、2.5米、3米、3.2米、\r\n" + 
				"水平定向钻（顶拉管机）：110型、150型、180型、200型、320型、380型、400型、450型、500型、680型、1500型、3000型、4000型、5000型、6600型及以上\r\n" + 
				"深井钻机：180米、300米、400米、530米、600米、700米、1000米、2400米及以上\r\n" + 
				"水井（浅孔）钻机：6米*400、6米*600、6米*800、20米*400、20米*600、20米800、40米*600、40米*400、40米*800\r\n" + 
				"桩基机械\r\n" + 
				"震动打桩机：150型、200型光伏桩、260型光伏桩、200型、260型、300型、450型、500型、600型、700型、800型及以上\r\n" + 
				"静压桩机：80吨、120吨、180吨、260吨、360吨、460吨、600吨、680吨、800吨、860吨、960吨、1000吨、1200吨及以上、\r\n" + 
				"柴油打桩机：轮式20、轮式23、筒式36、筒式46、筒式50、筒式62、筒式72、筒式80、筒式100、导杆式36、导杆式45、导杆式55、导杆式65、导杆式75、导杆式85、导杆式100\r\n" + 
				"双轮铣槽机：25型、32型、40型、55型、62型、70型、80型、100型、120型、135型及以上\r\n" + 
				"地下连续墙抓斗：22型、26型、35型、40型、46型、50型、60型、70型及以上、\r\n" + 
				"地下连续墙钻孔机：100型、150型、220型、260型\r\n" + 
				"锚杆机：80型、120型、130型、150型、160型\r\n" + 
				"湿喷砂机（台车）：20型台车、30型台车、08型、15型、25型\r\n" + 
				"强夯机：200型、320型、400型、460型、500型、600型、800型、1000型、\r\n" + 
				"盾构机\r\n" + 
				"小型顶管盾构机：0.8米、1.2米、1.5米、2.2米、3.2米、4米、\r\n" + 
				"土压平衡盾构机：6米、6.5米、7.6米、8.6米\r\n" + 
				"泥水平衡盾构机：4米、6.5米、7.6米、8.6米、9.5米、12米、15米\r\n" + 
				"岩石盾构机：6.4米、7.5米、8.6米\r\n" + 
				"沥青设备\r\n" + 
				"沥青洒布车：4方、8方、12方\r\n" + 
				"同步碎石封层车：沥青6料斗8方、沥青6料斗10方、沥青6料斗12方、沥青8料斗12方、沥青8料斗14方\r\n" + 
				"稀浆封层车：沥青2.7料斗9方、沥青3料斗10方、沥青3.5料斗10方、沥青3.5料斗12方、沥青4料斗12方、沥青4.5料斗14方\r\n" + 
				"沥青搅拌站：40吨/小时、80吨/小时、120吨/小时、160吨/小时、240吨/小时、320吨/小时、400吨/小时及以上、\r\n" + 
				"热再生修补车：小型、中型、大型\r\n" + 
				"摊铺机\r\n" + 
				"沥青直板摊铺机：2.5-6.0米轮式、2.5-6.0米、3.0-7.5米、3.0-9.0米、3.0-12米、15米及以上\r\n" + 
				"沥青伸缩板摊铺机：0.8-3.2米轮式、1.2-4.2米轮式、0.8-3.2米、2.0-4.5米、2.5-9米、3-8米、3-9米、3-12米\r\n" + 
				"水稳摊铺机：2.5-4.5米轮式、2.5-6米轮式、3.0-6.0米、3.0-7.5米、3.0-9.0米、3.0-12米、15米及以上\r\n" + 
				"水泥滑模摊铺机：侧滑模15型、侧滑模25型、500型、600型、900型、1200型、1500型\r\n" + 
				"开沟机\r\n" + 
				"链式开沟机：10公分1米型、15公分1.5米型、20公分1.5米型、20公分2米型、30公分2.5米型、50公分2.5米型、\r\n" + 
				"刀盘开沟机：10公分0.5米型、10公分1米型、15公分1米型、20公分1.2米型、20公分1.5米型\r\n" + 
				"矿山机械\r\n" + 
				"隧道掘进机：120型、160型、220型、260型、300型、320型、520型、620型\r\n" + 
				"凿岩机（潜孔钻机）：小型气动手持、单臂架150、单臂架260、单臂架400、双臂架200\r\n" + 
				"移动破碎机（站）：挖机配破碎斗10型、挖机配破碎斗20型、履带90型、履带120型、履带180型、履带240型、履带360型、履带450型、轮胎90型、轮胎150型、轮胎240型\r\n" + 
				"矿用自卸车：12方、18方、25方、30方、45方、60方、90方、120方、150方及以上\r\n" + 
				"挖泥船\r\n" + 
				"绞吸挖泥船：60方、100方、200方、300方、500方、700方、1000方、2000方、2500方、\r\n" + 
				"链斗挖泥船：60方、100方、200方、300方及以上、\r\n" + 
				"射吸挖泥船：100方、200方、300方、500方及以上、\r\n" + 
				"挖树机\r\n" + 
				"轮式挖树机：60型、80型、60链锯型、80链锯型、100型\r\n" + 
				"履带式挖树机：60型、80型、100型、120型\r\n" + 
				"特种物资设备\r\n" + 
				"住人集装箱：6米*3米带空调、6米*3米、8米*3米\r\n" + 
				"发电机组：20千瓦、30千瓦、50千瓦、100千瓦、150千瓦、200千瓦、300千瓦、400千瓦、500千瓦、800千瓦、1200千瓦、1600千瓦\r\n" + 
				"铺路钢板：6米*1米*1.2、6米*1.5米*1.5、6米*1.5米*1.2\r\n" + 
				"钢板桩：U型6米*45、U型6米*75、U型9米*57、U型9米*75、Z型6米*65、Z型9米*65\r\n" + 
				"钢管桩：660*25、660*30、660*45、920*30、920*45、3000*60、5000*60及以上、\r\n" + 
				"流动加油车：柴油、汽油";
		String[] split = str.split("\r\n");
		
		Integer mId = 1;
		
		Integer tId = 1;
		
		Integer sId = 1;
		for (String string : split) {
			if(!string.contains("：")) {
				if(StringUtils.isBlank(string)) {
					System.err.println("000000000000000000000000000000000");
				}
				System.out.println(string);
				ModelDO m = new ModelDO();
				m.setId(Long.valueOf(mId.toString()));
				m.setName(string);
				modelMapper.insertSelective(m);
				mId++;

			}else {
				String[] split2 = string.split("：");
				if(StringUtils.isBlank(split2[0])) {
					System.err.println("1111111111111111111111111111111111");
				}
				System.out.println(split2[0]+"---");
				TwoStagemodelDO t = new TwoStagemodelDO();
				t.setId(Long.valueOf(tId.toString()));
				Integer c =(mId-1);
				t.setModelId(c.toString());
				t.setName(split2[0]);
				
				twoStagemodelMapper.insertSelective(t);
				tId++;
				String[] split3 = split2[1].split("、");
				for (String string2 : split3) {
					if(StringUtils.isBlank(string2)) {
						System.err.println("1111111111111111111111111111111111");
					}
					System.out.println(string2+"---spec");
					SpecDO s = new SpecDO();
					s.setId(Long.valueOf(sId));
					s.setTwoStageModeId(Long.valueOf(tId-1));
					s.setName(string2);
					specMapper.insertSelective(s);
					sId++;
				}

			}
		}
	*/}
}
